Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (PolyBeam, Point)
 Splits the polybeam and creates a new one in the given position.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PolyBeam Split(
	PolyBeam Object,
	Point SplitPoint
)
Public Shared Function Split (
	Object As PolyBeam,
	SplitPoint As Point
) As PolyBeam
Parameters
Object
Type: Tekla.Structures.Model.PolyBeam
The beam object to be split.
SplitPoint
Type: Tekla.Structures.Geometry3d.Point
The position where splitting is executed.
Return Value
Type: PolyBeam
The created polybeam on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace